---
kind: enumMember
id: F:Autodesk.Revit.DB.BRepBuilderState.AcceptingData
enum: Autodesk.Revit.DB.BRepBuilderState
source: html/fc45f13e-33ba-47ca-3faf-558517899a90.htm
---
# Autodesk.Revit.DB.BRepBuilderState.AcceptingData

BRepBuilder is accumulating data. New b-rep components such as edges or faces may be added.